In [24]:
import pandas as pd
students = {"EEID":[1,2,3,1,5,6,7,8,3],
           "name":["a","b","c","d","e","f","g","h","i"]}

df1 = pd.DataFrame(students)
df1

   EEID name
0     1    a
1     2    b
2     3    c
3     1    d
4     5    e
5     6    f
6     7    g
7     8    h
8     3    i

In [25]:
df1["EEID"].duplicated().sum()

2

In [26]:
df1 = df1.drop_duplicates(subset = "EEID")
df1

   EEID name
0     1    a
1     2    b
2     3    c
4     5    e
5     6    f
6     7    g
7     8    h